package homework3.seсond;

public class Person {
    public void sayHello() {
        System.out.println("Привет!");
    }
}

// Создайте два одинаковый имени класса в разный пакетах.
// В одном и том же методы попытайтесь создать экземпляры обеих классов
