package homework3.first;

public class Person {
    public void sayHello() {
        System.out.println("Добрый день!");
    }
}

// Создайте два одинаковый имени класса в разный пакетах.
// В одном и том же методы попытайтесь создать экземпляры обеих классов